MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog to Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x4000A810</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2815</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_IRQ</name>
        <description>ADC Interrupt</description>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>ADC_ISR</name>
          <displayName>ADC_ISR</displayName>
          <description>ADC interrupt status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAOVF</name>
              <description>DMAOVF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAT</name>
              <description>SAT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMABF</name>
              <description>DMABF</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMABHF</name>
              <description>DMABHF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_IER</name>
          <displayName>ADC_IER</displayName>
          <description>ADC interrupt enable register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAOVFIE</name>
              <description>DMAOVFIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATIE</name>
              <description>SATIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMABFIE</name>
              <description>DMABFIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMABHFIE</name>
              <description>DMABHFIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CR</name>
          <displayName>ADC_CR</displayName>
          <description>ADC control register</description>
          <addressOffset>0x27F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001800</resetValue>
          <fields>
            <field>
              <name>SMP</name>
              <description>SMP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HVSELP</name>
              <description>HVSELP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HVSELN</name>
              <description>HVSELN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSELP</name>
              <description>CHSELP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CHSELN</name>
              <description>CHSELN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLK</name>
              <description>CLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADON</name>
              <description>ADON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_OFFSETR</name>
          <displayName>ADC_OFFSETR</displayName>
          <description>ADC offset register</description>
          <addressOffset>0x27F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>OFFSET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_GAINR</name>
          <displayName>ADC_GAINR</displayName>
          <description>ADC gain register</description>
          <addressOffset>0x27FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>GAIN</name>
              <description>GAIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMACR</name>
          <displayName>ADC_DMACR</displayName>
          <description>ADC DMA control register</description>
          <addressOffset>0x2800</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Write 1 to reset the ADC
              DMA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AUTOWRAP</name>
              <description>Selects DMA mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Loads the DMA buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMASR</name>
          <displayName>ADC_DMASR</displayName>
          <description>ADC DMA status register</description>
          <addressOffset>0x2804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AOVF</name>
              <description>AOVF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACT</name>
              <description>ACT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMAMSAR</name>
          <displayName>ADC_DMAMSAR</displayName>
          <description>ADC DMA memory start address
          register</description>
          <addressOffset>0x2808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>MSA</name>
              <description>MSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMANDTR</name>
          <displayName>ADC_DMANDTR</displayName>
          <description>ADC DMA number of data to transfer
          register</description>
          <addressOffset>0x280C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>NDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMAMNAR</name>
          <displayName>ADC_DMAMNAR</displayName>
          <description>ADC DMA memory next address
          register</description>
          <addressOffset>0x2810</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>MNA</name>
              <description>MNA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DMACNDTR</name>
          <displayName>ADC_DMACNDTR</displayName>
          <description>ADC DMA count number of data transferred
          register</description>
          <addressOffset>0x2814</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNDT</name>
              <description>CNDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
