MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_DBG</name>
      <description>General purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40004028</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7BDD</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_DBGCR</name>
          <displayName>GPIO_DBGCR</displayName>
          <description>GPIO debug configuration
          register</description>
          <addressOffset>0x7BD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>DBGDIS</name>
              <description>DBGDIS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTREGEN</name>
              <description>EXTREGEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_DBGSR</name>
          <displayName>GPIO_DBGSR</displayName>
          <description>GPIO debug status register</description>
          <addressOffset>0x7BDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTMODE</name>
              <description>BOOTMODE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORCEDBG</name>
              <description>FORCEDBG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWEN</name>
              <description>SWEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PCTRACECR</name>
          <displayName>GPIO_PCTRACECR</displayName>
          <description>Clock PC trace register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEL</name>
              <description>selects PC_TRACE source on bb_debug GPIO
              pins</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDG</name>
      <description>Watchdog timer</description>
      <groupName>WDG</groupName>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x9</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDG_CR</name>
          <displayName>WDG_CR</displayName>
          <description>WDG configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>WDGDIS</name>
              <description>WDGDIS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGEN</name>
              <description>WDGEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_KR</name>
          <displayName>WDG_KR</displayName>
          <description>WDG key register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_KICKSR</name>
          <displayName>WDG_KICKSR</displayName>
          <description>WDG kick-start register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KS</name>
              <description>KS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK</name>
      <description>Clock</description>
      <groupName>CLK</groupName>
      <baseAddress>0x40000008</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4025</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_SLEEPCR</name>
          <displayName>CLK_SLEEPCR</displayName>
          <description>Sleep timer control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>LSEEN</name>
              <description>Enables 32kHz external
              XTAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSI10KEN</name>
              <description>Enables 10kHz internal RC during
              deep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_LSI10KCR</name>
          <displayName>CLK_LSI10KCR</displayName>
          <description>LSI Clock (10KHz) control
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TUNE</name>
              <description>Tune value for clkrc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_LSI1KCR</name>
          <displayName>CLK_LSI1KCR</displayName>
          <description>LSI Clock (1KHz) control
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00005000</resetValue>
          <fields>
            <field>
              <name>CLKFRAC</name>
              <description>Divider value fractional
              portion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>CALINT</name>
              <description>Divider value integer
              portion</description>
              <bitOffset>11</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_HSECR1</name>
          <displayName>CLK_HSECR1</displayName>
          <description>HSE Clock (24MHz) control register
          1</description>
          <addressOffset>0x3FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>BIASTRIM</name>
              <description>Bias trim setting for 24MHz
              oscillator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_HSICR</name>
          <displayName>CLK_HSICR</displayName>
          <description>HSI Clock (12MHz) trim
          register</description>
          <addressOffset>0x4000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>TUNE</name>
              <description>Frequency trim setting for HF RC
              oscillator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_PERIODCR</name>
          <displayName>CLK_PERIODCR</displayName>
          <description>Clock period control register</description>
          <addressOffset>0x4008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>Sets clock to be measured by
              CLK_PERIOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_PERIODSR</name>
          <displayName>CLK_PERIODSR</displayName>
          <description>Clock period status register</description>
          <addressOffset>0x400C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Clock period measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_DITHERCR</name>
          <displayName>CLK_DITHERCR</displayName>
          <description>Clock dither control register</description>
          <addressOffset>0x4010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIS</name>
              <description>Dither disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_HSECR2</name>
          <displayName>CLK_HSECR2</displayName>
          <description>HSE Clock (24MHz) control register
          2</description>
          <addressOffset>0x4014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW1</name>
              <description>OSCHF/XTAL is selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>MHz crystal oscillator is main
              clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CPUCR</name>
          <displayName>CLK_CPUCR</displayName>
          <description>Clock source select register</description>
          <addressOffset>0x4018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW2</name>
              <description>12MHz/24MHz is selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
