MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SLPTMR</name>
      <description>Sleep timer</description>
      <groupName>SLPTMR</groupName>
      <baseAddress>0x4000600C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4049</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SLPTIM_IRQ</name>
        <description>Sleep Timer Interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>SLPTMR_CR</name>
          <displayName>SLPTMR_CR</displayName>
          <description>SLPTMR configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000400</resetValue>
          <fields>
            <field>
              <name>REVERSE</name>
              <description>REVERSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBGP</name>
              <description>DBGP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSC</name>
              <description>PSC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>CLKSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CNTH</name>
          <displayName>SLPTMR_CNTH</displayName>
          <description>SLPTMR counter high register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTH</name>
              <description>CNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CNTL</name>
          <displayName>SLPTMR_CNTL</displayName>
          <description>SLPTMR counter high register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTL</name>
              <description>CNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CMPAH</name>
          <displayName>SLPTMR_CMPAH</displayName>
          <description>SLPTMR compare A high register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>CMPAH</name>
              <description>CMPAH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CMPAL</name>
          <displayName>SLPTMR_CMPAL</displayName>
          <description>SLPTMR compare A low register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>CMPAL</name>
              <description>CMPAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CMPBH</name>
          <displayName>SLPTMR_CMPBH</displayName>
          <description>SLPTMR compare B high register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>CMPBH</name>
              <description>CMPBH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_CMPBL</name>
          <displayName>SLPTMR_CMPBL</displayName>
          <description>SLPTMR compare B low register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>CMPBL</name>
              <description>CMPBL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_ISR</name>
          <displayName>SLPTMR_ISR</displayName>
          <description>SLPTMR interrupt status
          register</description>
          <addressOffset>0x4008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPB</name>
              <description>CMPB</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPA</name>
              <description>CMPA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OW</name>
              <description>OW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_IFR</name>
          <displayName>SLPTMR_IFR</displayName>
          <description>SLPTMR force interrupts
          register</description>
          <addressOffset>0x4014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPB</name>
              <description>CMPB</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPA</name>
              <description>CMPA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OW</name>
              <description>OW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPTMR_IER</name>
          <displayName>SLPTMR_IER</displayName>
          <description>SLPTMR interrupt enable
          register</description>
          <addressOffset>0x4048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRAP</name>
              <description>WRAP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPA</name>
              <description>CMPA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPB</name>
              <description>CMPB</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
