MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MEM</name>
      <description>Memory Control registers</description>
      <groupName>RAM</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x29</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RAMPROTR1</name>
          <displayName>RAMPROTR1</displayName>
          <description>Memory protection register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT1</name>
              <description>RAMPROT1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR2</name>
          <displayName>RAMPROTR2</displayName>
          <description>Memory protection register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT2</name>
              <description>RAMPROT2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR3</name>
          <displayName>RAMPROTR3</displayName>
          <description>Memory protection register3</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT3</name>
              <description>RAMPROT1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR4</name>
          <displayName>RAMPROTR4</displayName>
          <description>Memory protection register4</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT4</name>
              <description>RAMPROT4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR5</name>
          <displayName>RAMPROTR5</displayName>
          <description>Memory protection register5</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT5</name>
              <description>RAMPROT5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR6</name>
          <displayName>RAMPROTR6</displayName>
          <description>Memory protection register6</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT6</name>
              <description>RAMPROT6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR7</name>
          <displayName>RAMPROTR7</displayName>
          <description>Memory protection register7</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT7</name>
              <description>RAMPROT7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPROTR8</name>
          <displayName>RAMPROTR8</displayName>
          <description>Memory protection register8</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMPROT8</name>
              <description>RAMPROT8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPROTR1</name>
          <displayName>DMAPROTR1</displayName>
          <description>DMA protection register1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>DMA protection fault, faulting
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>offset in RAM</description>
              <bitOffset>14</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPROTR2</name>
          <displayName>DMAPROTR2</displayName>
          <description>DMA protection register2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>DMA protection fault, faulting
              channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMCR</name>
          <displayName>RAMCR</displayName>
          <description>Memory configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WEN</name>
              <description>Makes all RAM write access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
