MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SC1_DMA</name>
      <description>Serial controller 1 (Direct memory
      access)</description>
      <groupName>SerialControll</groupName>
      <baseAddress>0x4000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x71</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SC1_DMARXBEGADDAR</name>
          <displayName>SC1_DMARXBEGADDAR</displayName>
          <description>Serial controller receive DMA begin address
          channel A register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXENDADDAR</name>
          <displayName>SC1_DMARXENDADDAR</displayName>
          <description>Serial controller receive DMA end address
          channel A register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXBEGADDBR</name>
          <displayName>SC1_DMARXBEGADDBR</displayName>
          <description>Serial controller receive DMA begin address
          channel B register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXENDADDBR</name>
          <displayName>SC1_DMARXENDADDBR</displayName>
          <description>Serial controller receive DMA end address
          channel B register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMATXBEGADDAR</name>
          <displayName>SC1_DMATXBEGADDAR</displayName>
          <description>Serial controller transmit DMA begin address
          channel A register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMATXENDADDAR</name>
          <displayName>SC1_DMATXENDADDAR</displayName>
          <description>Serial controller transmit DMA end address
          channel A register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMATXBEGADDBR</name>
          <displayName>SC1_DMATXBEGADDBR</displayName>
          <description>Serial controller transmit DMA begin address
          channel B register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMATXENDADDBR</name>
          <displayName>SC1_DMATXENDADDBR</displayName>
          <description>Serial controller transmit DMA end address
          channel B</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXCNTAR</name>
          <displayName>SC1_DMARXCNTAR</displayName>
          <description>Serial controller receive DMA counter
          channel A register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXCNTBR</name>
          <displayName>SC1_DMARXCNTBR</displayName>
          <description>Serial controller receive DMA count channel
          B register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMATXCNTR</name>
          <displayName>SC1_DMATXCNTR</displayName>
          <description>Serial controller transmit DMA counter
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMASR</name>
          <displayName>SC1_DMASR</displayName>
          <description>Serial controller DMA status
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSSS</name>
              <description>NSSS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FEB</name>
              <description>FEB</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEA</name>
              <description>FEA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEB</name>
              <description>PEB</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEA</name>
              <description>PEA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRB</name>
              <description>OVRB</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRA</name>
              <description>OVRA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXBACK</name>
              <description>TXBACK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXAACK</name>
              <description>TXAACK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBACK</name>
              <description>RXBACK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXAACK</name>
              <description>RXAACK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMACR</name>
          <displayName>SC1_DMACR</displayName>
          <description>Serial controller DMA control
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXRST</name>
              <description>TXRST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRST</name>
              <description>RXRST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXLODB</name>
              <description>TXLODB</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLODA</name>
              <description>TXLODA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLODB</name>
              <description>RXLODB</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLODA</name>
              <description>RXLODA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXERRAR</name>
          <displayName>SC1_DMARXERRAR</displayName>
          <description>Serial controller receive DMA channel A
          first error register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXERRBR</name>
          <displayName>SC1_DMARXERRBR</displayName>
          <description>Serial controller receive DMA channel B
          first error register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_DMARXCNTSAVEDR</name>
          <displayName>SC1_DMARXCNTSAVEDR</displayName>
          <description>Serial controller receive DMA saved counter
          channel B register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
