MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SC1_SPI</name>
      <description>Serial controller 1 (Serial peripheral
      interface)</description>
      <groupName>SerialControll</groupName>
      <baseAddress>0x4000C840</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x19</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SC1_SPISR</name>
          <displayName>SC1_SPISR</displayName>
          <description>Serial controller SPI status
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDLE</name>
              <description>IDLE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXE</name>
              <description>TXE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNE</name>
              <description>RXNE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>OVF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1_SPICR</name>
          <displayName>SC1_SPICR</displayName>
          <description>Serial controller SPI control
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXMODE</name>
              <description>RXMODE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSTR</name>
              <description>MSTR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPTEN</name>
              <description>RPTEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>LSBFIRST</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPHA</name>
              <description>CPHA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPOL</name>
              <description>CPOL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SC2_DMA</name>
      <description>Serial controller 2 (Direct memory
      access)</description>
      <groupName>SerialControll</groupName>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x71</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SC2_DMARXBEGADDAR</name>
          <displayName>SC2_DMARXBEGADDAR</displayName>
          <description>Serial controller receive DMA begin address
          channel A register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXENDADDAR</name>
          <displayName>SC2_DMARXENDADDAR</displayName>
          <description>Serial controller receive DMA end address
          channel A register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXBEGADDBR</name>
          <displayName>SC2_DMARXBEGADDBR</displayName>
          <description>Serial controller receive DMA begin address
          channel B register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXENDADDBR</name>
          <displayName>SC2_DMARXENDADDBR</displayName>
          <description>Serial controller receive DMA end address
          channel B register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMATXBEGADDAR</name>
          <displayName>SC2_DMATXBEGADDAR</displayName>
          <description>Serial controller transmit DMA begin address
          channel A register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMATXENDADDAR</name>
          <displayName>SC2_DMATXENDADDAR</displayName>
          <description>Serial controller transmit DMA end address
          channel A register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMATXBEGADDBR</name>
          <displayName>SC2_DMATXBEGADDBR</displayName>
          <description>Serial controller transmit DMA begin address
          channel B register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMATXENDADDBR</name>
          <displayName>SC2_DMATXENDADDBR</displayName>
          <description>Serial controller transmit DMA end address
          channel B register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXCNTAR</name>
          <displayName>SC2_DMARXCNTAR</displayName>
          <description>Serial controller receive DMA counter
          channel A register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXCNTBR</name>
          <displayName>SC2_DMARXCNTBR</displayName>
          <description>Serial controller receive DMA count channel
          B register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMATXCNTR</name>
          <displayName>SC2_DMATXCNTR</displayName>
          <description>Serial controller transmit DMA counter
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMASR</name>
          <displayName>SC2_DMASR</displayName>
          <description>Serial controller DMA status
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSSS</name>
              <description>NSSS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FEB</name>
              <description>FEB</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEA</name>
              <description>FEA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEB</name>
              <description>PEB</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEA</name>
              <description>PEA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRB</name>
              <description>OVRB</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRA</name>
              <description>OVRA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXBACK</name>
              <description>TXBACK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXAACK</name>
              <description>TXAACK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBACK</name>
              <description>RXBACK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXAACK</name>
              <description>RXAACK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMACR</name>
          <displayName>SC2_DMACR</displayName>
          <description>Serial controller DMA control
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXRST</name>
              <description>TXRST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRST</name>
              <description>RXRST</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXLODB</name>
              <description>TXLODB</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLODA</name>
              <description>TXLODA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLODB</name>
              <description>RXLODB</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLODA</name>
              <description>RXLODA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXERRAR</name>
          <displayName>SC2_DMARXERRAR</displayName>
          <description>Serial controller receive DMA channel A
          first error register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXERRBR</name>
          <displayName>SC2_DMARXERRBR</displayName>
          <description>Serial controller receive DMA channel B
          first error register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SC2_DMARXCNTSAVEDR</name>
          <displayName>SC2_DMARXCNTSAVEDR</displayName>
          <description>Serial controller receive DMA saved counter
          channel B register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
