MaJerle/stm32f429/00-STM32_SVD/STM32W108.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MAC_TIM</name>
      <description>MAC timer</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40002038</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x55</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MAC_TIM_IRQ</name>
        <description>MAC Timer Interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>MACTMR_CNTR</name>
          <displayName>MACTMR_CNTR</displayName>
          <description>MACTMR counter register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>MAC timer count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTMR_CR</name>
          <displayName>MACTMR_CR</displayName>
          <description>MACTMR configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>MAC timer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RST</name>
              <description>MAC timer reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
